
#import "VVMock.h"

NSString * const chars = @"a b c d e f g h i j k l m n o p q r s t u v w x y z A B C D E F G H I J K L M N O P K R S T U V W X Y Z 1 2 3 4 5 6 7 8 9 0";

NSString * const lastNames = @"王 李 张 刘 陈 杨 赵 黄 周 吴 徐 孙 胡 朱 高 林 何 郭 马 罗 梁 宋 郑 谢 韩 唐 冯 于 董 萧 程 曹 袁 邓 许 傅 沈 曾 彭 吕 苏 卢 蒋 蔡 贾 丁 魏 薛 叶 阎 余 潘 杜 戴 夏 锺 汪 田 任 姜 范 方 石 姚 谭 廖 邹 熊 金 陆 郝 孔 白 崔 康 毛 邱 秦 江 史 顾 侯 邵 孟 龙 万 段 雷 钱 汤 尹 黎 易 常 武 乔 贺 赖 龚 文";

NSString * const firstNames = @"怡君 雅婷 欣怡 雅雯 家豪 怡婷 宗翰 雅惠 志豪 心怡 建宏 佳蓉 佩珊 靜怡 志偉 雅玲 佩君 俊宏 佳穎 怡伶 婉婷 俊傑 郁婷 怡如 鈺婷 靜宜 彥廷 冠宇 佳玲 詩婷 家瑋 承翰 詩涵 佳慧 惠雯 宜君 雅琪 雅文 柏翰 韻如 思穎 俊賢 玉婷 淑芬 琬婷 家銘 怡靜 冠廷 雅萍 怡萱 信宏 婷婷 惠婷 淑娟 馨儀 威廷 雅慧 淑惠 佩蓉 哲瑋 智偉 淑婷 宜芳 佳樺 珮瑜 嘉玲 依婷 雅芳 欣儀 慧君 芳瑜 俊豪 宗憲 哲維 志宏 家瑜 雅涵 宜靜 筱婷 佳琪 怡文 淑君 郁雯 冠宏 士豪 惠君 家榮 嘉宏 偉倫 雅筑 怡潔 慧玲 佩玲 欣穎 建志 惠如 雅君 明哲 怡安 孟儒 于婷 俊宇 美玲 欣宜 俊廷 志鴻 彥君 宗霖 芳儀 俊毅 怡慧 瑋婷 佩璇 美君 珮君 建良 政宏 建銘 柏宏 志強 雅琳 佳雯 惠玲 仁傑 書豪 志銘 淑玲 智凱 盈君 思妤 佳霖 士傑 智翔 建宇 婉如 淑萍 子豪 偉哲 凱翔 文傑 建勳 博文 筱涵 淑華 彥宏 郁涵 佳欣 志遠 怡璇 嘉慧 佳伶 宇軒 嘉文 玉玲 俊凱 思婷 千惠 雅芬 建豪 莉婷 立偉 志明 怡菁 淑貞 靜雯 家宏 淑慧 明宏 怡芳 舒婷 雅茹 書瑋 俊佑 冠霖 怡雯 俊銘 建智 雅如 哲宇 佩穎 宜蓁 姿吟 宜珊 家維 柏勳 凱文 佩芬 建文 明翰 怡秀 惠文 佳容 人豪 宗穎 筱雯 婉君 雅鈴 智傑 佳怡 凱婷 文彥 世偉 俊良 俊彥 欣樺 彥儒 育誠 蕙如 文豪 瓊文 伊婷 俊瑋 思涵 哲豪 嘉琪 芳如 姿君 家偉 姿穎 佩樺 慧如 聖文 文馨 郁文 慧雯 秀玲 怡欣 嘉偉 怡均 馨慧 婉瑜 英傑 佳君 怡萍 靜儀 美惠 彥霖 振宇 政翰 家慧 佳芳 文彬 佳瑩 宜臻 俊男 明憲 柏毅 家慶 韋廷 姿瑩 建廷 姿伶 美慧 佩怡 安琪 佳靜 慧娟 欣潔 鎮宇 柏廷 千慧 盈如 珮如 慧婷 志瑋 子翔 昱廷 淑芳 建成 柏宇 宜庭 佳惠 靖雯 慧珊 威志 彥良 志成 曉雯 佳宏 建中 維倫 子軒 承恩 俊德 凱傑 宗賢 宜婷 彥伶 惠茹 建安 俊霖 哲銘 文君 育如 家齊 志文 珮綺 怡臻 建霖 佩芳 孟君 宜真 聖傑 庭瑋 乃文 君豪 玉如 孟穎 淑敏 威宇 秋萍 俊達 宜樺 美芳 佳儀 偉誠 可欣 嘉鴻 文凱 家華 世豪 志傑 世傑 舒涵 文婷 志忠 姵君 雯婷 雅嵐 秀娟 淑媛 家弘 佩宜 政達 政勳 佩真 嘉惠 意婷 世昌 育賢 宗儒 慧敏 怡蓁 宜潔 郁芬 冠伶 佩娟 佳燕 麗君 孟潔 珮雯 惠萍 姿蓉 淑雯 宛蓉 雅菁 瓊慧 惠敏 世杰 珮珊 冠穎 嘉雯 靜芳 國豪 怡廷 志賢 孟哲 靜如 正偉 佩琪 毓婷 明勳 佩瑜 曉君 依潔 佳琳 育瑋 明慧 俊偉 怡樺 美娟 子傑 志龍 宛儒 玉芳 冠儒 孟翰 偉翔 怡芬 逸群 奕廷 家祥 柏豪 博仁 怡真 念慈 孟勳 柏翔 惠娟 玫君 國維 竹君 美如 于庭 彥翔 雅淳 偉豪 曉薇 佳芬 家賢 韋伶 宛真 佩儀 佳芸 曉婷 瑋倫 湘婷 鈺雯 孟軒 麗娟 珮甄 維哲 佳儒 偉傑 于珊 莉雯 宗佑 淑真 智仁 偉銘 佩如 佳宜 嘉豪 思潔 志維 仁豪 柏均 玉珊 怡華 瑋玲 慧萍 柏鈞 麗雯 政憲 俊諺 耀文 家綺 建華 孟璇 姿儀 欣蓉 欣瑜 彥豪 佩雯 巧玲 佳勳 智文 韻婷 柏霖 佳純 聖凱 建佑 國華 珮琪 美伶 蕙君 佳真 婉菁 佳蓁 雅欣 宇翔 彥文 明峰 婉玲 玉芬 育德 雅馨 欣慧 俊杰 政霖 思翰 倩如 佩芸 彥志 韋志 建興 志宇 明達 宗勳 子揚 士賢 馨文 凱鈞 柏凱 盈潔 彥甫 曉玲 雅晴 佩瑩 彥宇 美華 如君 俊翰 志誠 文賢 明倫 怡蓉 慧茹 子涵 裕翔 慧真 冠傑 思賢 宏偉 曉菁 怡珊 婉茹 姿婷 思瑩 明志 鴻文 盈秀 俊榮 弘毅 欣儒 智豪 郁珊 東霖 佩儒 于萱 育民 文琪 明賢 育菁 瓊儀 婕妤 耀仁 郁茹 育銘 彥均 依璇 政緯 孟樺 育慈 靜芬 姿妤 俊穎 淑如 思樺 俊緯 育瑄 文宏 玟君 筱薇 文正 柏諺 健銘 依玲 文 俊翔 俊仁 宜玲 詩怡 俐君 家琪 立婷 彥勳 士哲 宗哲 建瑋 俊維 冠文 智鈞 俊嘉 郁翔 書銘 俊安 志軒 冠華 明儒 俊明 志杰 佳瑜 秀慧 家欣 國瑋 景翔 智堯 怡穎 柏瑋 育萱 健豪 秉勳 建德 峻瑋 玉娟 柏元 明軒 宗達 家瑩 佳璇 宜萱 致遠 筱芸 淑卿 明芳 曉萍 子瑜 香君 思吟 鈺涵 育霖 耀德 彥銘 冠中 怡瑩 詩雅 宜欣 冠豪 亭君 峻豪 怡瑄 志祥 志峰 家緯 怡嘉 筱君 逸軒 依萍 岳霖 逸凡 玉萍 慧芳 貞儀 宛臻 哲緯 書維 俊逸 淑珍 明潔 婉甄 雨潔 慧珍 思慧 偉智 瑋 曉琪 慧貞 心瑜 冠樺 麗如 振豪 昱宏 立群 郁芳 雅云 政哲 哲偉 靖雅 國榮 佩伶 彥如 怡禎 秀雯 俊吉 欣妤 宏達 佳倫 雅鈞 大為 玟伶 孟珊 宜芬 志榮 婷 俊成 柏青 文怡 佳臻 曉慧 佳吟 政賢 庭瑜 宜璇 玉雯 文欣 文斌 佳珍 嘉琳 彥鈞 郁欣 珮慈 馨瑩 柏安 彥婷 永昌 宗樺 哲民 育豪 曉芬 怡妏 智超 明德 敏華 耀中 明輝 啟宏 建邦 建明 佩欣 雅莉 易霖 宜穎 國峰 淑怡 秀如 靜慧 尚儒 惠琪 秋燕 雅娟 嘉瑩 志翔 秉翰 俊儒 文祥 國偉 寧 俊憲 凱元 慧文 晏如 志仁 靜茹 美琪 嘉祥 安妮 惠珍 博凱 冠儀 鳳儀 家興 博元 明杰 俊雄 家禎 維真 雅雲 偉志 瑋珊 淑美 詩穎 珮瑄 婕 宗祐 志揚 彥博 政諺 裕仁 信豪 銘鴻 文華 俊龍 昱翔 建璋 凱琳 士弘 欣如 力瑋 詠翔 奕君 偉成 博鈞 建榮 宏仁 金龍 哲安 惠菁 瑞鴻 冠甫 怡玲 佩吟 詩雯 大維 嘉駿 惠珊 政儒 柏志 智強 永祥 昆霖 漢威 文龍 嘉倫 勝傑 育正 俐伶 建彰 育廷 佳琦 怡貞 家誠 凱雯 冠良 家寧 彥伯 于真 淑雅 晉嘉 婉柔 佩萱 景文 嘉芸 思齊 虹君 孟修 玉菁 怡儒 秀芬 宜儒 懿萱 宏銘 奕安 怡青 偉民 冠瑋 秀婷 家儀 承勳 依珊 建忠 書瑜 建男 婉琳 妍伶 心儀 宏文 瑜珊 信良 盈盈 鼎鈞 孟婷 佩容 世明 宜珍 致豪 淑儀 子芸 美吟 孟蓉 智勇 淑鈴 玉潔 奕辰 育儒 佳鴻 巧雯 彥傑 明宗 嘉芳 欣蓓 士銘 嘉仁 詩芸 怡珍 佩茹 婉萍 宗毅 世賢 俞君 彥佑 柏仁 柏儒 麗婷 明璋 建樺 宜軒 郁仁 建緯 銘宏 孟娟 志堅 珊珊 宜慧 佳盈 筱筠 佳翰 育嘉 仁宏 逸婷 信安 士軒 思嘉 珮茹 惠芳 文政 文心 宛君 雅琴 英哲 瑞祥 志雄 慧怡 嘉慶 建甫 奕翔 政穎 書賢 明君 怡寧 孟芳 傑 凱倫 筱筑 宛玲 允中 玉琳 啟銘 美儀 育婷 佳音 佳恩 明修 震宇 宜蓉 威任 昱辰 宏儒 政偉 育維 自強 明穎 麗華 文志 婉真 竣傑 柏辰 哲嘉 偉婷 嘉容 宛庭 仲豪 家源 廷宇 玉華 聖翔 品潔 淑菁 子維 盈瑩 曉嵐 君儀 子婷 柏成 宛婷 鈺翔 婉琪 昱豪 惠美 志鵬 聖哲 亞璇 明鴻 維仁 柏村 銘哲 珮玲 大鈞 薇如 智瑋 依靜 耀賢 美秀 曉涵 志平 育仁 韋翔 秀芳 柏賢 冠銘 晉瑋 文瑜 家駿 彥蓉 俊儀 振瑋 雅琦 姿慧 宛諭 宜娟 柏任 鈺茹 鈺珊 冠群 書婷 佳瑋 信傑 宇婷 慧慈 韻竹 伟 芳 娜 秀英 敏 静 丽 强 磊 军 洋 勇 艳 杰 娟 涛 明 超 秀兰 霞 平 刚 桂英";

// article.length = 3885;
NSString * const article = @"2002年，一家名为亿迅的客服外包公司向媒体算了笔账：平均一个Call Center（呼叫中心）人工座席的建设成本为10万元，而一个初具规模的Call Center则需要有50个座席。这样，以50个座席计算，一个Call Center的建设费用就高达500万元。总裁李冰影判断，呼叫中心外包是趋势。彼时，硬件软件成本高企，而呼叫中心集成了程控交换机、排队机、CTI网关和语音记录系统等多种设备和系统，于是成为高科技高投入行业。十几年后，软硬件成本下降，但外包趋势不可逆。呼叫中心从高科技行业转为劳动密集型行业，电话客服代表，及其背后的培训、管理、流程协调成为成本的大头，并且越来越贵。行业人员不再提坐席建设成本，他们更愿意将“单呼成本”（每一通电话的成本）视为关键。“呼叫中心的成本是要抠到每一秒钟的，每一秒都是钱。”一家企业的客服负责人李伟（化名）告诉我，这家企业有着业内公认的成熟客服体系，其每秒成本为3分钱，1分钟成本为一块八。也就是说，一个客户打了5分钟的投诉电话，这家企业就花出9块钱。客服成本高不是问题，但问题是客服中心不是盈利部门而是成本中心。“一个客服人才解决纠纷的能力再强，他也不赚钱。中国企业喜欢看人效比（平均每个人给公司创造的利润），不赚钱的话，我为什么要养那么多客服？特别是高级客服？”李伟说道。于是企业自然将客服外包出去。在经营有压力的企业中，客服成为其缩减开支的重要板块。“这么多年客服一直都是这样子的，每家都说客服很重要，但是没人愿意给客服掏钱。”回到文章题目，为什么接你电话的客服总是解决不了问题？答案：钱。一、外包不是问题8月25日中午，浙江省乐清市公安局官方微博@乐清公安发布信息，破获一起滴滴顺风车司机强奸杀害女乘客的案件。在这起事件中，滴滴客服的反应备受诟病。根据被害人好友吴某在微博上披露，他曾在15：42到16：42期间，先后7次与滴滴平台联系，询问事件进展，客服回应称，“一线客服没有权限，请您耐心等待，您的反馈我们会为您加急标红”、“将有相关安全专家介入处理此事，会在1小时内回复。”但数小时过后仍然没有反馈。警方也表示，在接到受害人亲友报警后，先后3次与滴滴联系请求提供犯罪嫌疑人车牌号以及其他个人信息。但从开始联系到真正获取到有效信息，前后耗时92分钟。出事后不久，媒体曝出滴滴客服为一家总部在上海的外包公司。于是，客服的迟钝反应似乎也有了解释。在固有的观点中，外包通常与“偷工减料”“不专业”划等号，将其改为自营能解决大半问题。但在客服领域有些不同，外包客服尤其是早期搭建起来的呼叫中心算得上专业。如文章开头所述，因为搭建呼叫中心，需要付出高额的软件、硬件成本，以及面临人员管理、招聘、培训等问题，所以能搭建呼叫中心的企业通常拥有较为雄厚的资金和技术实力。1995年，美国客户服务领域权威咨询机构COPC制定了一套服务标准，后来这一标准成为国际上公认的呼叫中心服务标准。由于COPC认证标准过于严格，并且需要付出百万级别认证费用和近一年的认证时间，因此国内通过COPC认证的呼叫中心并不多。2004年联想的呼叫中心成为第一个通过认证的呼叫中心，为此联想在当年曾特意召开过一次发布会，足见重视。同一年，又一个企业紧跟联想获得认证，这是一个总部位于上海的专门提供外包服务的呼叫中心。相比较国内企业多采用“自营+外包”的模式，大部分欧美企业更倾向于选择外包。一个被广为引用的数据是，在世界500强企业中，将一项或多项重要业务流程交给商业呼叫中心来完成的企业超过90%。汇丰银行是少数坚持自营客服的金融企业，曾在印度搭建自营呼叫中心，但在2008年金融危机期间，也选择将其出售。汇丰与收购方签订一个十年的服务合同，来保持服务的正常进行，但成本下降。王强（化名）就职于国内某大型呼叫中心，“一些企业把客服外包出来不单纯是出于成本考虑，还有一个原因是学习借鉴，像我们这种体量，不是只做一个客户，而是一堆客户，有些客户服务是互通的，我们可以跟他们提建议。”他告诉我。身在甲方的李伟也有同样的表述：“不要觉得外包，质量就下来了。这个行业的一些规范是由外包建立起来的，企业得去取经。”“当然，我说的是正规的外包公司。”王强补充道。二、问题是没钱既然外包公司具备专业技能，那为什么在滴滴事件中表现得如此业余？答案在权限上。依据界面报道，滴滴的外包客服均为一线客服，其权限仅有“接电话”和“提交”，即便是组长，权限也仅限于向用户提供代金券补偿，金额为5元。一线客服可以将投诉加急处理给上一级客服，但也有比例限制，加急的比例不能超过10%。这涉及到客服最常用的两个权限：赔偿权限、投诉升级权限。滴滴一线客服的赔偿权限约等于零。互联网公司一线客服的赔偿权限普遍不高，即便自营模式的京东，也只有20元。在知乎上，京东一线客服透露，其赔偿的最大权限是2000京东（100京豆可替代1元），有业内人士告诉我，这在互联网企业里已经算是一线客服的较高赔偿权限。此前锤子手机出现系统升级导致微信聊天记录清空的问题，客服回复是赔偿一个充电宝。一线客服解决不了，就升级到高级客服去解决，这涉及到“投诉升级权限”。但王强告诉我，并不是所有一线解决不了的问题都能升级到高级客服去，甲方会设定一些限制条件，比如滴滴有比例限制。“我们做的是整个流程的外包，相当把他们的招聘、培训、业务流程梳理，甚至流程优化，我们完全复制过来。区别就是他们的人员权限高于我们。所以这就造成了外包行业客服在处理投诉的时候，很多东西都做不了决定。”王强说。为什么不能开放权限？因为关系到成本。赔偿成本。身在甲方，李伟的表述比较直白：“外包会问你会给我多少资源。那你是往多里给，还是往少里给？如果给得多了，外包肯定会卡着上限用；如果给得少了，外包会说不够用。不管多少，外包肯定会把你的资源用到最后一滴的。”处在外包公司的王强坦承，提高赔偿权限，会存在员工乱用的风险。“这个就看甲方对于用户体验的理解，如果这个事情给用户造成损失五百块钱，这五百块钱，一分钟解决赔付和半个月赔付，完全就是两种体验。”人力成本。高级客服无论在薪资水平还是培养成本上都远高于一线客服。“配置1000个高级客服跟配置100个高级客服成本不一样。所以要控制住高级投诉的数量。”培训成本。给到的资源越多，意味着培训难度越大，提高培训成本。成本不仅限制一线客服的权限，也限制了优质服务模式的推广。在客服行业，有一个模式叫“首问负责制”也叫“一站到底”（One Stop Service），由一个人或一个小团队将一个投诉从头跟到尾，并且这个人/团队能协调内外部资源解决问题。这避免了同一个人的投诉被不同的客服接听，要不断重复阐述问题，极大提升用户体验。但这一模式只有少部分企业在应用。“这个成本非常高。呼入和呼出电话的成本是不一样的。客服主动把电话打出去比用户把电话打过来，花费的时间更长，所以呼出成本更高。更关键的是，首问负责制比较占用人力，举例本来上午排班有20个人，但有两个人要去负责专门的投诉，这样影响接起率等指标。”李伟说。三、最终还是回到价值观上呼叫中心垂直网站CTI，曾披露一个行业数据：在呼叫中心的成本结构中，人力资源是最大项目，占有全部成本比例均超过二分之一，（占比）最高（的呼叫中心）能达到80%。巨大的成本压力之下，呼叫中心外迁成为大势。在国际上，欧美国家偏爱菲律宾。菲律宾人口有1.049亿，位于全球第13位，且官方语言为英语。所以近两年，地处东南亚的菲律宾在近些年超过印度成为最大的外包服务提供国。依据菲律宾《商业镜报》报道，到2016年，菲服务外包产业收入将达到250亿美元，从业人员将达到130万人。Convergys，全球最大的服务外包商，在菲律宾的分公司有30多家，它在全球的雇员有12.5万人，其中一半都在菲律宾。更早时候，摩根大通将14000座席的呼叫中心也从美国迁移到了菲律宾。而国内，由于与“互联网+”挂钩，且进入门槛低，能解决大量劳动力就业问题，因此呼叫中心成为各三四线政府争抢的引入项目。合肥喊出“中国呼叫中心之都”的口号，要建设10万座席，创造30万就业岗位。《贵阳日报》则称，贵阳呼叫中心规模已经成为全国第五大，仅次于北上广苏。一时间，各地呼叫中心产业基地扎堆儿出现。但致富不忘乡亲。2009年，刘强东将京东全国客户服务中心放在老家宿迁，据说带动了2万人就业，贡献20亿的税收。2017年11月，江西上饶人程维出现在首届赣商大会，宣布将在老家上饶建立一个大型互联网客服中心，座席将达3000个。既致富乡亲又降低人力成本，一举两得。不过这还不够，为降低成本，客服外包企业们会与学校合作，以实习名义招用未毕业的学生。凤凰科技援引滴滴外包商的话：“滴滴为了尽量压低成本，甚至会暗示我们，大专以上学历都不需要，有的供应商会招聘十五六岁的实习生。”这似乎是行业公开的秘密，甚至有老师撰写诸如《客服外包公司与高职学校合作的利弊研究》的研究文章，来证实其可行性。但对于血汗工厂的形容，外包商们觉得有些委屈，“像国内某最大电商平台，他们要求是起码本科起的。这个就是甲方客户以及业务的不同来要求的。不是我们想招什么样的，而是他们要招什么样的。”王强说。在他看来，甲方对于客服的投入，归结为这个企业对客户的重视程度，而这归根结底源于其价值观。客服行业从业者愿意用亚马逊来举例什么是“客户至上”：每次客服沟通是没有时长限制的、一线客服有直接免单权限……于是，本文标题的答案最后又回归到企业价值观上";

// articleEn.length = 757;
NSString * const articleEn = @"China has published a report on the human rights situation in the US, which exposed Washington's human rights violations in such areas as the prevalence of money politics, rising income inequality and worsening racial discrimination. The report, titled \"Human Rights Record of the United States in 2018\" was released by the Information Office of the State Council on Thursday. \n It said the US government, a self-styled \"human rights defender\", has a human rights record which is flawed and lackluster, and the double standards of human rights it pursues are obvious.According to the report, the US 2018 midterm elections cost a huge quantity of money as elections in the country became games of money, with much involvement of \"dark money\" and corruption.";

@interface VVMock ()
@property (nonatomic, strong) NSArray *charArray;
@property (nonatomic, strong) NSArray *firstNameArray;
@property (nonatomic, strong) NSArray *lastNameArray;
@end

@implementation VVMock

+ (instancetype)shared{
    static VVMock *_mock;
    static dispatch_once_t onceToken;
    dispatch_once(&onceToken, ^{
        _mock = [[self alloc] init];
    });
    return _mock;
}

- (instancetype)init{
    self = [super init];
    if (self) {
        _charArray = [chars componentsSeparatedByString:@" "];
        _firstNameArray = [firstNames componentsSeparatedByString:@" "];
        _lastNameArray = [lastNames componentsSeparatedByString:@" "];
    }
    return self;
}

- (NSString *)nick{
    return [self charTextWithMinLen:4 maxLen:16];
}

- (NSString *)name{
    NSString *first = _firstNameArray[arc4random_uniform((uint32_t)_firstNameArray.count)];
    NSString *last = _firstNameArray[arc4random_uniform((uint32_t)_lastNameArray.count)];
    return [NSString stringWithFormat:@"%@%@",last,first];
}

- (NSString *)shortText{
    NSInteger loc = arc4random_uniform(3885 - 20);
    NSInteger len = 2 + arc4random_uniform(18);
    return [article substringWithRange:NSMakeRange(loc, len)];
}

- (NSString *)longText{
    NSInteger loc = arc4random_uniform(3885 - 100);
    NSInteger len = 20 + arc4random_uniform(80);
    return [article substringWithRange:NSMakeRange(loc, len)];
}

- (NSString *)longLongText{
    NSInteger loc = arc4random_uniform(3885 - 1000);
    NSInteger len = 100 + arc4random_uniform(900);
    return [article substringWithRange:NSMakeRange(loc, len)];
}

- (NSString *)textEn{
    NSInteger loc = arc4random_uniform(757 - 100);
    NSInteger len = 20 + arc4random_uniform(80);
    return [articleEn substringWithRange:NSMakeRange(loc, len)];
}

- (NSString *)mobile{
    return [NSString stringWithFormat:@"+86%@%@%@",
            @(130 + arc4random_uniform(60)),
            @(1000 +arc4random_uniform(8999)),
            @(1000 +arc4random_uniform(8999))];
}

- (NSString *)email{
    return [NSString stringWithFormat:@"%@@%@.com",[self charTextWithMinLen:4 maxLen:16],[self charTextWithMinLen:3 maxLen:8]];
}

//MARK: - Private
- (NSString *)charTextWithMinLen:(NSUInteger)minLen maxLen:(NSUInteger)maxLen{
    NSInteger len = minLen + arc4random_uniform((uint32_t)(maxLen - minLen));
    NSMutableString *text = [NSMutableString stringWithCapacity:0];
    uint32_t count = (uint32_t)_charArray.count;
    for (NSInteger i = 0; i < len; i ++) {
        NSInteger idx = arc4random_uniform(count);
        [text appendString:_charArray[idx]];
    }
    return text;
}


@end
